adpyke.vscode-sql-formatter
alefragnani.bookmarks
alexcvzz.vscode-sqlite
amazonwebservices.aws-toolkit-vscode
arjun.swagger-viewer
batisteo.vscode-django
bierner.markdown-mermaid
bradlc.vscode-tailwindcss
cipchk.cssrem
dbaeumer.vscode-eslint
docker.docker
eamodio.gitlens
editorconfig.editorconfig
esbenp.prettier-vscode
formulahendry.code-runner
foxundermoon.shell-format
gamunu.vscode-yarn
github.copilot
github.copilot-chat
golang.go
hashicorp.terraform
hbenl.vscode-test-explorer
humao.rest-client
inferrinizzard.prettier-sql-vscode
mechatroner.rainbow-csv
mikestead.dotenv
mongodb.mongodb-vscode
mrmlnc.vscode-scss
ms-azuretools.vscode-docker
ms-python.black-formatter
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode-remote.remote-wsl
ms-vscode-remote.vscode-remote-extensionpack
ms-vscode.cmake-tools
ms-vscode.cpptools
ms-vscode.cpptools-extension-pack
ms-vscode.cpptools-themes
ms-vscode.hexeditor
ms-vscode.makefile-tools
ms-vscode.remote-explorer
ms-vscode.remote-server
ms-vscode.test-adapter-converter
njpwerner.autodocstring
rangav.vscode-thunder-client
redhat.java
redhat.vscode-xml
redhat.vscode-yaml
redis.redis-for-vscode
ritwickdey.liveserver
rvest.vs-code-prettier-eslint
shd101wyy.markdown-preview-enhanced
tomoki1207.pdf
twxs.cmake
usernamehw.errorlens
vscode-icons-team.vscode-icons
vscodevim.vim
xabikos.javascriptsnippets
yoavbls.pretty-ts-errors
zhuangtongfa.material-th